# Jupyter Notebook是一个基于web网页的,交互式的编程笔记本,让你把代码,运行结果,图标和笔记全部放在一个文件里
# 可以直接在PyCharm里直接创建
# 常用快捷键 : ctrl+回车 快速得到最后一行运行结果
# shift+回车 快速创建一个节点

# Pandas是一个工能强大的结构数据化工具集,是python的扩展库
# Pandas两大核心:DataFrame(类似表格)      Series(类似表格中的一列)

# DataFrame:pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
# data:数据本体（决定你用哪种构造方式）
# index:索引,行标签，不给就自动生成 0,1,2...
# columns:列只有 data 里不含列名时才需要手动给）
# dtype:数据类型

# 构造方法
# 1.df1= pd.DataFrame([
# {字典1},
# {字典2}
# ])
# 类似于匹配

# 2.df2= pd.DataFrame({
# 列1: [列表1],
# 列2: [列表2]
# })
# 类似于一列一列写

# 3.df3= pd.DataFrame([
# [行1列表1]
# [行2列表2]
# ], columns=[列1名, 列2名])
# 类似与一行一行写最后加上每一列代表什么

# 常用属性:df.index拿到索引,df.columns拿到列名,df.values拿到每一个单元格的值,df.shape获得元组封装的(行数,列数)
# 增加列:df['新列名']= '新列值'
# 删除列:df.drop('列名', axis=1) # axis=1表示列, axis=0表示行


# -------------------------------------------------------------------------------------------------------------
# Series构造方法
# 1.s1= pd.Series([列表])
# 2.s2= pd.Series(列表, index=[索引]) # 索引必须和列表长度一致
# 3.s3= pd.Series({字典}) 这里的键就是索引,值就是存放的值
# 4.s4= df1[列名] # 取DataFrame中某列数据
# 常用属性:s.index拿到索引,s.values拿到每一个单元格的值,s.shape获得元组封装的(行数,)
# get方法得到某个索引的值，例如：s1.get(0)
# tolist函数将Series转换成列表,.str转换成字符串,例如：s1.str
# --------------------------------------------------------------------------------------------------------------
# 读用 pd.read_xxx()，写用 df.to_xxx()，例如 pd.read_csv(), df.to_csv()
# 读取pd.read_xxx() 给你一张表（DataFrame）返回

# ---------------------------------------------------------------------------------------------------------------
# 数据查看,选择和过滤

# 查看
# df.head(n):查看前n行数据
# df.tail(n):查看结尾n行数据
# df.describe():数值列统计信息,会返回一个df列表,显示统计的信息(平均值,最大最小等)
# df.info():查看数据信息,有多少信息,是不是非空以及数据类型
# df.shape:数据形状
# df.columns:数据列名

# 选择
# df['列名']:操作单列
# df[['列1','列2']]:操作多列
# df.iloc[start:end:step]:基于行号操作多行数据(不包含end)(是以行号来的,和索引无关)
# df.loc[start:end:step]:基于索引操作多行数据(包含end)----------注意二者基于的东西不一样
# 不指示索引二者一样

# 过滤
# 单条件过滤:df[[df["评分"] > 9.5]]
#         isin / between（在集合内 / 在区间内）df[df["年份"].isin([1994, 1997])] df[df["评分"].between(9.4, 9.6)]
# 多条件组合:&-并且 | -或者
# 不同条件要用括号括起来，例如：(df1['Rating'] > 88) & (df1['Rating'] < 92)

# --------------------------------------------------------------------------------------------------------------
# 数据清洗:处理缺失值,处理重复值,处理异常值,处理类别数据
# pd.set_option('display.max_rows', n) 表示设置显示n行数据

# 查看缺失值
# df.isnull():判断是否缺失值,返回布尔值,是返回True,否返回False
# df.notnull():判断是否非缺失值,返回布尔值,是返回True,否返回False
# 缺失值处理
# df.dropna():删除缺失值,注意是直接删除这一行,当然也可以设置为删除列,例如：df.dropna(axis=1)
# df.fillna():填充缺失值,例如：df.fillna(0)
# df.ffill():前向填充缺失值,用上一行的数据填充
# df.bfill():后向填充缺失值,用下一行的数据填充
#------------------------------------------------------------------------------------------------------------------
# 查看重复值
# df.duplicated():判断是否重复值(所有列的值都一样),返回布尔值,是返回True,否返回False
# 当然()里可以设置指定行的数据重复，例如：df.duplicated(['列1', '列2'])
# 删除
# df.drop_duplicates():删除重复值,注意是直接删除这一行,当然也可以设置为删除列,例如：df.drop_duplicates(axis=1)
# 正常情况下是保留第一次,删除第二次及以后的重复值,可以用keep参数设置保留哪个,例如：df.drop_duplicates(keep='last')保留最后一个删除其他,keep=false全删
# -------------------------------------------------------------------------------------------------------------------
# 查看异常值
# 用过滤查看异常值
# 删除异常值
# df.drop(要删除的行索引)
# 可以修复异常值
# ------------------------------------------------------------------------------------------------------------------
# 数据排序
# df.sort_values(by='列名', ascending=True) # 升序

# df.sort_values(by='列名', ascending=False) # 降序

# df.sort_values(by=['列1', '列2'], ascending=[True, False]) # 多列排序,注意先排列1再排列2

# df.sort_index() # 按索引排序
# df.reset_index(drop=True) # 重置索引
# ------------------------------------------------------------------------------------------------------------------
# 数据分组
# df.groupby('列名'),按某一列的值进行分组,可以单独保存这个分组对象，后面随时拿它做各种操作；但只写 groupby，不接任何方法，打印出来就只是对象地址，看不到数据
# df.groupby(['列1', '列2'])
# 分组后可以进行各种统计操作，例如：count(), sum(), mean(), max(), min(), std()等
# count() 统计个数
# sum() 求和
# mean() 平均值
# max() 最大值
# min() 最小值
# std() 标准差
# agg() 自定义统计操作
# 例如：df.groupby('列名').agg('sum', 'mean')
# 也可以传入一个字典，指定对每一列进行不同的统计操作
# 例如：df.groupby('列名').agg({'列1': 'sum', '列2': 'mean'})
# 还可以使用lambda函数进行自定义统计操作，例如：df.groupby('列名').agg(lambda x: x.sum())















