# 命令行即Linux终端,是一个命令提示符页面,以纯"字符"的形式操作系统
# 命令即Linux程序,一个命令就是一格Linux程序,没有图形化页面,可以在命令行中提供字符化的反馈
# 命令行和命令是Linux操作系统的基础,是Linux操作系统的灵魂

# Linux命令的基础格式
# command [-options] [parameter]
# command:就是命令本身
# -options:[可选,非必填]就是命令的选项,用于修改命令的默认行为
# parameter:[可选,非必填]就是命令的参数,用于指定命令操作的对象

# ls 命令 列出当前工作目录(默认HOME目录)下的内容
# ls [-a -l -h] [Linux路径]
# 注意HOME不是home,HOME的Linux路径是:/home/用户名
# -a:显示所有文件,包括隐藏文件(以.开头)
# -l:以列表显示文件信息,并有更多信息
# -h:以人类可读的格式显示文件大小,和l一起使用不然没啥作用
# 当然我们可以混合使用这些选项,例如:ls -a -l -h
# 参数:Linux路径 默认为当前工作目录,可以填入其他目录路径列出该目录下的内容

# cd 命令 切换工作目录
# 语法 cd [Linux目录]
# 啥也不写回到HOME目录
# 写上就转到该目录
# pwd命令,无选项,无参数,直接输入,作用是输出当前所在的工作目录

# 绝对路径:以/开始,就是以根目录为起点,描述路径的一种写法,路径描述以/开头
# 相对路径:以当前目录为起点,描述路径的一种写法,路径无需以/开头
# 特殊路径符 '.','..','~'
# .:当前目录
# ..:上一级目录,写cd..可以向上退一级
# ~:HOME目录
# 例如:cd ~就回到HOME目录

# mkdir [-p] Linux 创建目录,参数是必填的
# 参数表示要创建的文件夹的路径,相对路径和绝对路径均可
# -p,表示自动创建不存在的父目录,是英语创建连续多层级的目录
# 创建文件夹需要修改权限,只能在HOME目录内执行

# 文件：用来存储具体数据，比如文本、图片、程序、视频等。
# 目录：也叫“文件夹”，用来组织、分类和存放文件及其他目录，本身通常不直接保存用户数据。

# 文件操作命令
# touch Linux路径
# 没有选项,无参数,直接输入,作用是创建一个空文件,如果文件存在则清空文件内容

# cat Linux路径
# 没有选项,无参数,直接输入,作用是输出文件内容

# more Linux路径
# 没有选项,无参数,直接输入,作用是分页输出文件内容,支持翻页,如果文件内容过多,可以一页一页查看
# 可以通过空格查看,通过q推出查看

# cp命令 [-r] 参数一 参数二
# cp用来复制文件和文件夹,-r可选,用于复制文件夹,表示递归

# mv命令 参数一 参数二
# mv用来移动文件和文件夹,也可以用来重命名文件和文件夹
# 参数一:要移动的文件或文件夹
# 参数二:目标位置
# 如果参数二存在,则将参数一移动到参数二位置
# 如果参数二不存在,则将参数一重命名为参数二

# rm命令 [-r -f] 参数一  参数二  参数三.....
# 参数1,2,3...表示要删除文件或文件夹的路径用空格隔开
# -r选项用于删除文件夹,表示递归
# -f选项用于强制删除,表示不提示
# Linux有通配符*来模糊匹配
# test*表示匹配所有以test开头的文件或文件夹
# *test表示匹配所有以test结尾的文件或文件夹
# *test*表示匹配所有包含test的文件或文件夹

# which 要查找的命令
# 用来查找命令(如cd,ls等)所在位置

# find命令去搜索指定的文件或文件夹
# 1.按文件名查找
# 语法:find [起始路径] -name [查找文件名]
# 支持通配符
# 切换到管理员用户来获得最大权限,可以在系统完成搜索
# 执行命令 su - root
# 退出管理员用户 输入命令 exit
# 2.按文件大小查找
# find 起始路径 -size +/-你[kmg]
# +,-表示大于小于
# n表示大小数字,kmg表示大小单位,k表示kb,m表示mb,g表示gb

#grep [-n] 关键字 文件路径
# 从文件中通过关键字过滤文件行
# 选项n,可选,表示在结果中显示行号
# 关键字:要搜索的字符串用""括起来
# 文件路径:要搜索的文件路径,可以做内容的输入端口

# wc [-c -m -l -w] 文件路径
# 统计文件的相关信息
# 选项c,m,l,w,可选,表示显示文件内容的字节数,字符数,行数,单词数
# 文件路径:要搜索的文件路径

# 管道符 | :表示管道符左边命令的结果作为右边命令的输入

# echo 输出的内容
# 在命令行输出内容
# 反引号 ` ` :表示执行命令,并将结果替换到命令行
# 重定向符 > :表示将命令行结果输出到文件,覆盖文件内容,左侧的结果写入右边的文件
# 重定向符 >> :表示将命令行结果输出到文件,追加文件内容,左侧的结果写入右边的文件

# tail [-f -num] Linux路径
# 可以查看文件尾部内容,跟踪文件的最新更改
# -f,表示持续跟踪
# -num,表示查看尾部多少行,默认是10行

# vi编辑器,是Linux最经典的文本编辑器
# vi编辑器的三种模式:命令模式,输入模式,底线模式
# 命令模式:输入命令,所敲的按键编辑器都理解为命令,以命令驱动不同功能
# 输入模式:输入内容,自由编辑
# 底线模式:输入命令,通常用于文件的保存退出如:Esc, :wq

# vi/ vim 文件路径
# 进入vi/ vim编辑器
# 若文件不存在就编辑新文件,进入后默认是命令模式,命令模式为主
# 按键i是进入输入模式,可以输入内容

# 在Linux中root拥有最大权限,可以执行任何操作
# 普通用户的权限一般在HOME目录不受控制
#su [-] 用户名
# 表示切换用户,默认是root用户
# -表示加载环境变量
# 切换用户后,可以通过exit命令退回上一个用户

# sudo 其他命令
# 可以临时以root权限执行其他命令
# 使用时需要给用户权限

# 为了更方便的管理,我们可以设置用户和用户组
# 用户可以加入多个用户组
# 创建组和用户要root权限
# 创建用户组
# groupadd 用户组名
# 删除用户组
# groupdel 用户组名

# useradd [-g -d] 用户名
# 增加用户
# -g,表示指定用户的组,不指定,会创建同名组并自动加入
# -d,表示指定HOME路径,不指定,会创建默认该用户HOME路径在/home/用户名

# userdel[-r] 用户名
# 删除用户
# -r,表示删除用户的同时删除该用户HOME目录

# id [用户名]
# 显示用户信息
# 如果不填用户名参数,则显示当前用户信息

# usermod -aG 用户组 用户名
# 在用户组中新增用户

# getent passwd
# 可以查看当前系统所有用户信息
# 七份信息,密码x:用户ID:组ID:描述信息:用户主目录:用户shell

# 通过ls-l展开可以查看文件权限信息
# 在第一部分可以查看文件类型和权限信息
# 开头是d,l,-表示类型,d表示文件夹,l表示软链接,-表示普通文件
# 后面9位三三一组,分别表示用户权限,用户组权限,其他用户权限
# 每组3位,分别表示读权限(r -),写权限(w -),执行权限(x -)

# 第三第四部分可以查看文件的所属用户和用户组

# chmod修改文件权限
# chmod [-R] 权限 文件或文件夹
# -R,对文件夹内的全部内容应用同样的操作
# 权限细节:u=用户权限(前三),g=用户组权限(中三),o=其他用户权限(后三),a=所有用户权限
# 例子:chmod u=rwx,g=w,o=r 文件名

# 权限可以用三位数字表示,每一位分别表示读权限(4),写权限(2),执行权限(1)
# 例子:chmod 755 文件名
# 755表示所有用户都有读权限,用户组用户有写权限,其他用户没有权限
# 就是二进制表示权限
# 只有所属用户和root才可以修改文件权限

# 只能由root用户修改文件所有者
# chown [-R] [用户][:][用户组] 文件或文件夹
# -R通chmod
# 用户:表示修改用户,不填则不修改用户
# 用户组:表示修改用户组,不填则不修改用户组
# :表示分隔符,区别用户和用户组

# ctrl+c:中断当前命令
# ctrl+d:退出登录
# history:输入后可以查看历史输入过的命令
# 通过!命令前缀可以执行历史命令
# ctrl+r:输入内容去匹配历史命令
# ctrl+l:清屏

# 使用yum为Linux安装软件,他也是一个命令,他的文件软件是.rpm
# yum [-y] [install|remove|search] 软件名称
# -y表示自动确认,无需手动安装或卸载
# install安装软件,remove卸载软件,search搜索软件

# systemctl start|stop|status|enable|disable 服务名
# 作用是控制管理软件服务
# start启动服务,stop停止服务,status查看服务状态,enable开机自启,disable取消开机自启

# ln -s 参数一 参数二
# 创建软链接
# 参数一:目标文件
# 参数二:链接文件,目的地

# date [-d] [+格式化字符串]
# 作用是显示或设置系统日期和时间
# -d可以按照给定字符串显示日期,一般用于日期计算
# %Y:年 %m:月 %d:日 %H:时 %M:分 %S:秒
# %y:年后两位 %s:时间戳

# 修改时区
# 一:删除旧时区文件
# 二:创建新时区文件

# IP地址主要两个版本 IPv4 和 IPv6
# IPv4地址格式:xxx.xxx.xxx.xxx,每组0-255,共4组,用点号隔开
# 127.0.0.1,这个IP代指本机
# 0.0.0.0,这个IP代指所有主机
# 域名:是IP地址的别名,方便记忆

# ping命令检查指定的网络服务器是否是可联通状态
# 语法:ping [-c num] [域名|IP地址]
# -c检查次数,默认是4次

# curl [-O] url
# 作用是下载文件,或者测试网络连接
# -O表示保存文件名,默认是保存为服务器文件名,下载时用到

# wget [-b] url
# 进行网络下载
# -b表示后台下载

# 计算机通信
# 计算机具体程序之间通讯,需要端口,端口是计算机网络中用于标识和定位进程的数字标签
# 通过IP只能定位到计算机,不能定位到具体程序,需要端口来定位具体程序

# 端口一般有三种:公认端口,注册端口,动态端口
# 公认端口:0-1023,需要root权限才能使用,通常用于系统服务
# 注册端口:1024-49151,需要申请才能使用
# 动态端口:49152-65535,都可以临时使用

# 环境变量
# 环境变量是一种key=value形式结构,用于存储配置信息
# 例如:PATH=/usr/local/bin:/usr/bin:/bin



















